apache/nuttx/arch/arm/src/lpc313x/lpc313x_usbotg.h
/************************************************************************************************
 * arch/arm/src/lpc313x/lpc313x_usbotg.h
 *
 *   Copyright (C) 2009 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <spudmonkey@racsa.co.cr>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC313X_USBOTG_H
#define __ARCH_ARM_SRC_LPC313X_USBOTG_H

/************************************************************************************************
 * Included Files
 ************************************************************************************************/

#include <nuttx/config.h>
#include "lpc313x_memorymap.h"

/************************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************************/

/* USBOTG register base address offset into the USBOTG domain ***********************************/

#define LPC313X_USBOTG_VBASE                (LPC313X_USBOTG_VSECTION)
#define LPC313X_USBOTG_PBASE                (LPC313X_USBOTG_PSECTION)

/* USBOTG register offsets (with respect to the base of the USBOTG domain) **********************/
                                                   /* 0x000 - 0x0ff: Reserved */
/* Device/host capability registers */

#define LPC313X_USBOTG_CAPLENGTH_OFFSET      0x100 /* Capability register length */
#define LPC313X_USBHOST_HCIVERSION_OFFSET    0x102 /* Host interface version number */
#define LPC313X_USBHOST_HCSPARAMS_OFFSET     0x104 /* Host controller structural parameters */
#define LPC313X_USBHOST_HCCPARAMS_OFFSET     0x108 /* Host controller capability parameters */
#define LPC313X_USBDEV_DCIVERSION_OFFSET     0x120 /* Device interface version number */
#define LPC313X_USBDEV_DCCPARAMS_OFFSET      0x124 /* Device controller capability parameters */

/* Device/host/OTG operational registers */

#define LPC313X_USBOTG_USBCMD_OFFSET         0x140 /* USB command (both) */
#define LPC313X_USBOTG_USBSTS_OFFSET         0x144 /* USB status (both) */
#define LPC313X_USBOTG_USBINTR_OFFSET        0x148 /* USB interrupt enable (both) */
#define LPC313X_USBOTG_FRINDEX_OFFSET        0x14C /* USB frame index (both) */
#define LPC313X_USBOTG_PERIODICLIST_OFFSET   0x154 /* Frame list base address (host) */
#define LPC313X_USBOTG_DEVICEADDR_OFFSET     0x154 /* USB device address (device) */
#define LPC313X_USBOTG_ASYNCLISTADDR_OFFSET  0x158 /* Next asynchronous list address (host) */
#define LPC313X_USBOTG_ENDPOINTLIST_OFFSET   0x158 /* Address of endpoint list in memory (device) */
#define LPC313X_USBOTG_TTCTRL_OFFSET         0x15C /* Asynchronous buffer status for embedded TT (host) */
#define LPC313X_USBOTG_BURSTSIZE_OFFSET      0x160 /* Programmable burst size (both) */
#define LPC313X_USBOTG_TXFILLTUNING_OFFSET   0x164 /* Host transmit pre-buffer packet tuning (host) */
#define LPC313X_USBOTG_BINTERVAL_OFFSET      0x174 /* Length of virtual frame (both) */
#define LPC313X_USBOTG_ENDPTNAK_OFFSET       0x178 /* Endpoint NAK (device) */
#define LPC313X_USBOTG_ENDPTNAKEN_OFFSET     0x17C /* Endpoint NAK Enable (device) */
#define LPC313X_USBOTG_CONFIGFLAG_OFFSET     0x180 /* Configured flag register (not used in lpc313x) */
#define LPC313X_USBOTG_PORTSC1_OFFSET        0x184 /* Port status/control 1 (both) */
#define LPC313X_USBOTG_OTGSC_OFFSET          0x1A4 /* OTG status and control (otg) */
#define LPC313X_USBOTG_USBMODE_OFFSET        0x1A8 /* USB device mode (both) */

#define LPC313X_USBDEV_USBCMD_OFFSET         0x140 /* USB command (both) */
#define LPC313X_USBDEV_USBSTS_OFFSET         0x144 /* USB status (both) */
#define LPC313X_USBDEV_USBINTR_OFFSET        0x148 /* USB interrupt enable (both) */
#define LPC313X_USBDEV_FRINDEX_OFFSET        0x14C /* USB frame index (both) */
#define LPC313X_USBDEV_DEVICEADDR_OFFSET     0x154 /* USB device address (device) */
#define LPC313X_USBDEV_ENDPOINTLIST_OFFSET   0x158 /* Address of endpoint list in memory (device) */
#define LPC313X_USBDEV_BURSTSIZE_OFFSET      0x160 /* Programmable burst size (both) */
#define LPC313X_USBDEV_BINTERVAL_OFFSET      0x174 /* Length of virtual frame (both) */
#define LPC313X_USBDEV_ENDPTNAK_OFFSET       0x178 /* Endpoint NAK (device) */
#define LPC313X_USBDEV_ENDPTNAKEN_OFFSET     0x17C /* Endpoint NAK Enable (device) */
#define LPC313X_USBDEV_PORTSC1_OFFSET        0x184 /* Port status/control 1 (both) */
#define LPC313X_USBDEV_USBMODE_OFFSET        0x1A8 /* USB device mode (both) */

#define LPC313X_USBHOST_USBCMD_OFFSET        0x140 /* USB command (both) */
#define LPC313X_USBHOST_USBSTS_OFFSET        0x144 /* USB status (both) */
#define LPC313X_USBHOST_USBINTR_OFFSET       0x148 /* USB interrupt enable (both) */
#define LPC313X_USBHOST_FRINDEX_OFFSET       0x14C /* USB frame index (both) */
#define LPC313X_USBHOST_PERIODICLIST_OFFSET  0x154 /* Frame list base address (host) */
#define LPC313X_USBHOST_ASYNCLISTADDR_OFFSET 0x158 /* Next asynchronous list address (host) */
#define LPC313X_USBHOST_TTCTRL_OFFSET        0x15C /* Asynchronous buffer status for embedded TT (host) */
#define LPC313X_USBHOST_BURSTSIZE_OFFSET     0x160 /* Programmable burst size (both) */
#define LPC313X_USBHOST_TXFILLTUNING_OFFSET  0x164 /* Host transmit pre-buffer packet tuning (host) */
#define LPC313X_USBHOST_BINTERVAL_OFFSET     0x174 /* Length of virtual frame (both) */
#define LPC313X_USBHOST_PORTSC1_OFFSET       0x184 /* Port status/control 1 (both) */
#define LPC313X_USBHOST_USBMODE_OFFSET       0x1A8 /* USB device mode (both) */

/* Device endpoint registers */

#define LPC313X_USBDEV_ENDPTSETUPSTAT_OFFSET 0x1AC /* Endpoint setup status */
#define LPC313X_USBDEV_ENDPTPRIME_OFFSET     0x1B0 /* Endpoint initialization */
#define LPC313X_USBDEV_ENDPTFLUSH_OFFSET     0x1B4 /* Endpoint de-initialization */
#define LPC313X_USBDEV_ENDPTSTATUS_OFFSET    0x1B8 /* Endpoint status */
#define LPC313X_USBDEV_ENDPTCOMPLETE_OFFSET  0x1BC /* Endpoint complete */
#define LPC313X_USBDEV_ENDPTCTRL0_OFFSET     0x1C0 /* Endpoint control 0 */
#define LPC313X_USBDEV_ENDPTCTRL1_OFFSET     0x1C4 /* Endpoint control 1 */
#define LPC313X_USBDEV_ENDPTCTRL2_OFFSET     0x1C8 /* Endpoint control 2 */
#define LPC313X_USBDEV_ENDPTCTRL3_OFFSET     0x1CC /* Endpoint control 3 */

/* USBOTG register (virtual) addresses **********************************************************/

/* Device/host capability registers */

