apache/nuttx/arch/arm/src/lpc313x/lpc313x_usbotg.h
#define LPC313X_USBOTG_CAPLENGTH             (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_CAPLENGTH_OFFSET)
#define LPC313X_USBHOST_HCIVERSION           (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_HCIVERSION_OFFSET)
#define LPC313X_USBHOST_HCSPARAMS            (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_HCSPARAMS_OFFSET)
#define LPC313X_USBHOST_HCCPARAMS            (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_HCCPARAMS_OFFSET)
#define LPC313X_USBDEV_DCIVERSION            (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_DCIVERSION_OFFSET)
#define LPC313X_USBDEV_DCCPARAMS             (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_DCCPARAMS_OFFSET)

/* Device/host operational registers */

#define LPC313X_USBOTG_USBCMD                (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_USBCMD_OFFSET)
#define LPC313X_USBOTG_USBSTS                (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_USBSTS_OFFSET)
#define LPC313X_USBOTG_USBINTR               (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_USBINTR_OFFSET)
#define LPC313X_USBOTG_FRINDEX               (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_FRINDEX_OFFSET)
#define LPC313X_USBOTG_PERIODICLIST          (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_PERIODICLIST_OFFSET)
#define LPC313X_USBOTG_DEVICEADDR            (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_DEVICEADDR_OFFSET)
#define LPC313X_USBOTG_ASYNCLISTADDR         (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_ASYNCLISTADDR_OFFSET)
#define LPC313X_USBOTG_ENDPOINTLIST          (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_ENDPOINTLIST_OFFSET)
#define LPC313X_USBOTG_TTCTRL                (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_TTCTRL_OFFSET)
#define LPC313X_USBOTG_BURSTSIZE             (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_BURSTSIZE_OFFSET)
#define LPC313X_USBOTG_TXFILLTUNING          (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_TXFILLTUNING_OFFSET)
#define LPC313X_USBOTG_BINTERVAL             (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_BINTERVAL_OFFSET)
#define LPC313X_USBOTG_ENDPTNAK              (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_ENDPTNAK_OFFSET)
#define LPC313X_USBOTG_ENDPTNAKEN            (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_ENDPTNAKEN_OFFSET)
#define LPC313X_USBOTG_PORTSC1               (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_PORTSC1_OFFSET)
#define LPC313X_USBOTG_OTGSC                 (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_OTGSC_OFFSET)
#define LPC313X_USBOTG_USBMODE               (LPC313X_USBOTG_VBASE+LPC313X_USBOTG_USBMODE_OFFSET)

#define LPC313X_USBDEV_USBCMD                (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_USBCMD_OFFSET)
#define LPC313X_USBDEV_USBSTS                (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_USBSTS_OFFSET)
#define LPC313X_USBDEV_USBINTR               (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_USBINTR_OFFSET)
#define LPC313X_USBDEV_FRINDEX               (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_FRINDEX_OFFSET)
#define LPC313X_USBDEV_DEVICEADDR            (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_DEVICEADDR_OFFSET)
#define LPC313X_USBDEV_ENDPOINTLIST          (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_ENDPOINTLIST_OFFSET)
#define LPC313X_USBDEV_BURSTSIZE             (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_BURSTSIZE_OFFSET)
#define LPC313X_USBDEV_BINTERVAL             (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_BINTERVAL_OFFSET)
#define LPC313X_USBDEV_ENDPTNAK              (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_ENDPTNAK_OFFSET)
#define LPC313X_USBDEV_ENDPTNAKEN            (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_ENDPTNAKEN_OFFSET)
#define LPC313X_USBDEV_PORTSC1               (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_PORTSC1_OFFSET)
#define LPC313X_USBDEV_USBMODE               (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_USBMODE_OFFSET)

#define LPC313X_USBHOST_USBCMD               (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_USBCMD_OFFSET)
#define LPC313X_USBHOST_USBSTS               (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_USBSTS_OFFSET)
#define LPC313X_USBHOST_USBINTR              (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_USBINTR_OFFSET)
#define LPC313X_USBHOST_FRINDEX              (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_FRINDEX_OFFSET)
#define LPC313X_USBHOST_PERIODICLIST         (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_PERIODICLIST_OFFSET)
#define LPC313X_USBHOST_ASYNCLISTADDR        (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_ASYNCLISTADDR_OFFSET)
#define LPC313X_USBHOST_TTCTRL               (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_TTCTRL_OFFSET)
#define LPC313X_USBHOST_BURSTSIZE            (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_BURSTSIZE_OFFSET)
#define LPC313X_USBHOST_TXFILLTUNING         (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_TXFILLTUNING_OFFSET)
#define LPC313X_USBHOST_BINTERVAL            (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_BINTERVAL_OFFSET)
#define LPC313X_USBHOST_PORTSC1              (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_PORTSC1_OFFSET)
#define LPC313X_USBHOST_USBMODE              (LPC313X_USBOTG_VBASE+LPC313X_USBHOST_USBMODE_OFFSET)

/* Device endpoint registers */

#define LPC313X_USBDEV_ENDPTSETUPSTAT        (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_ENDPTSETUPSTAT_OFFSET)
#define LPC313X_USBDEV_ENDPTPRIME            (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_ENDPTPRIME_OFFSET)
#define LPC313X_USBDEV_ENDPTFLUSH            (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_ENDPTFLUSH_OFFSET)
#define LPC313X_USBDEV_ENDPTSTATUS           (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_ENDPTSTATUS_OFFSET)
#define LPC313X_USBDEV_ENDPTCOMPLETE         (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_ENDPTCOMPLETE_OFFSET)
#define LPC313X_USBDEV_ENDPTCTRL0            (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_ENDPTCTRL0_OFFSET)
#define LPC313X_USBDEV_ENDPTCTRL1            (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_ENDPTCTRL1_OFFSET)
#define LPC313X_USBDEV_ENDPTCTRL2            (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_ENDPTCTRL2_OFFSET)
#define LPC313X_USBDEV_ENDPTCTRL3            (LPC313X_USBOTG_VBASE+LPC313X_USBDEV_ENDPTCTRL3_OFFSET)

/* USBOTG register bit definitions **************************************************************/

/* Device/host capability registers */
/* CAPLENGTH (address 0x19000100) */

#define USBOTG_CAPLENGTH_SHIFT               (0)       /* Bits 0-7: Offset from register base to operational regs */
#define USBOTG_CAPLENGTH_MASK                (0xff << USBOTG_CAPLENGTH_SHIFT)

/* HCIVERSION (address 0x19000102) */

